; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-5-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p1-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s0)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at package1 s2)
	(at package2 s0)
	(at package3 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 61)
	(= (time-to-walk p0-2 s0) 61)
	(= (time-to-walk s2 p0-2) 44)
	(= (time-to-walk p0-2 s2) 44)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 13)
	(= (time-to-walk p1-0 s1) 13)
	(= (time-to-walk s0 p1-0) 15)
	(= (time-to-walk p1-0 s0) 15)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 51)
	(= (time-to-walk p2-1 s2) 51)
	(= (time-to-walk s1 p2-1) 97)
	(= (time-to-walk p2-1 s1) 97)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 97)
	(= (time-to-drive s0 s1) 97)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 62)
	(= (time-to-drive s2 s1) 62)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver3 s1)
	(at driver4 s2)
	(at truck2 s0)
	(at truck4 s0)
	(at truck5 s2)
	(at package1 s2)
	(at package2 s2)
	(at package3 s0)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 2  (walked))))

)

; plan
1. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 2 of 8
2. (walk driver4 s0 p0-2)
   deleted: (at driver4 s0)
   added: (at driver4 p0-2)
   changed: (walked) from 0 to 61
   goals met: 2 of 8
3. (walk driver4 p0-2 s2)
   deleted: (at driver4 p0-2)
   added: (at driver4 s2)
   changed: (walked) from 61 to 105
   goals met: 3 of 8
4. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 3 of 8
5. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 0 to 97
   goals met: 3 of 8
6. (load-truck package3 truck1 s1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   goals met: 3 of 8
7. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 97 to 194
   goals met: 3 of 8
8. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 4 of 8
9. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 194 to 291
   goals met: 4 of 8
10. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 3 of 8
11. (drive-truck truck2 s2 s1 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 291 to 353
   goals met: 3 of 8
12. (drive-truck truck1 s1 s2 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 353 to 415
   goals met: 3 of 8
13. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 3 of 8
14. (drive-truck truck2 s1 s0 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 415 to 512
   goals met: 4 of 8
15. (disembark-truck driver4 truck2 s0)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 4 of 8
16. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   goals met: 5 of 8
17. (walk driver4 s0 p0-2)
   deleted: (at driver4 s0)
   added: (at driver4 p0-2)
   changed: (walked) from 105 to 166
   goals met: 5 of 8
18. (walk driver4 p0-2 s2)
   deleted: (at driver4 p0-2)
   added: (at driver4 s2)
   changed: (walked) from 166 to 210
   goals met: 6 of 8
19. (board-truck driver4 truck4 s2)
   deleted: (at driver4 s2) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 5 of 8
20. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   changed: (walked) from 210 to 261
   goals met: 5 of 8
21. (drive-truck truck4 s2 s1 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (driven) from 512 to 574
   goals met: 5 of 8
22. (drive-truck truck4 s1 s0 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 574 to 671
   goals met: 6 of 8
23. (disembark-truck driver4 truck4 s0)
   deleted: (driving driver4 truck4)
   added: (at driver4 s0) (empty truck4)
   goals met: 6 of 8
24. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   changed: (walked) from 261 to 358
   goals met: 7 of 8
25. (walk driver4 s0 p0-2)
   deleted: (at driver4 s0)
   added: (at driver4 p0-2)
   changed: (walked) from 358 to 419
   goals met: 7 of 8
26. (walk driver4 p0-2 s2)
   deleted: (at driver4 p0-2)
   added: (at driver4 s2)
   changed: (walked) from 419 to 463
   goals met: 8 of 8
